In [34]:
#!pip install pymysql
#!pip install sqlalchemy

In [35]:
import pandas as pd
import numpy as np

import pymysql                       # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass

In [36]:
password = getpass()

········

In [37]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

In [38]:
type(engine)

sqlalchemy.engine.base.Engine

In [39]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,None
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,None
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,None
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,None
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,None

In [40]:
data.shape

(16044, 8)

In [41]:
data.dtypes

rental_id                int64
rental_date     datetime64[ns]
inventory_id             int64
customer_id              int64
return_date     datetime64[ns]
staff_id                 int64
last_update     datetime64[ns]
day_type                object
dtype: object

In [44]:
def rentals_month(engine, month, year=2005):
    query = "SELECT * FROM sakila.rental WHERE MONTH(rental_date) = "+str(month)+" AND YEAR(rental_date) = "+str(year)
    
    may_rentals = pd.read_sql_query(query, engine)
    return may_rentals

In [45]:
may2005 = rentals_month(engine, 5, 2005)
may2005

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,None
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,None
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,None
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,None
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,None
...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,None
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,None
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,None
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,None
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,None

In [ ]:
# def rentals_month(x):
#     query = pd.read_sql_query("SELECT *, \
#     SUBSTRING(rental_date, 1, 4) AS year, \
#     SUBSTRING(rental_date, 6, 2) AS month \
#     FROM rental", engine)
#     rentals_month(data1)

In [46]:
def rental_count_month(data, month, year=2005):
    
    rentals_by_customer = data.loc[(data['rental_date'].dt.month == month) & (data['rental_date'].dt.year == year)]\
                          .groupby('customer_id')['rental_id'].count().reset_index()

    rentals_by_customer = rentals_by_customer.rename(columns={'rental_id': f'rentals_{month}_{year}'})

    return rentals_by_customer

In [ ]:
# def rentals_month (engine, year, month):
#     query = "SELECT SUBSTRING(rental_date, 1, 4) AS year, SUBSTRING(rental_date, 6, 2) AS month FROM rental"

#     month_year_dataframe = pd.read_sql_query(query, engine)

#     return month_year_dataframe
# example = rentals_month(engine, 2005, 5)
# def rental_count_month(df,month,year):
#     column_name = "month"+ "year"
#     query = (f'SELECT rental.customer_id, COUNT(rental.rental_id) AS {column_name} FROM sakila.rental GROUP BY rental.customer_id')

#     rentals_count = pd.read_sql_query(query, engine)

    
    
#     return rentals_count

# def rental_count_month(df,month,year):
#     column_name = f"rentals_{month:02}_{year}"
#     query = f"SELECT customer_id ,COUNT(rental_id) AS {column_name} FROM rental GROUP BY customer_id"
#     rental_count_df=pd.read_sql(query,engine)
#     return rental_count_df

In [48]:
customer_rentals_may = rental_count_month(may2005, 5)
customer_rentals_may

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [49]:
def compare_rentals(data1, data2):
   
    merged_data = pd.merge(data1, data2, on='customer_id')

    merged_data['difference'] = merged_data[data1.columns[1]] - merged_data[data2.columns[1]]

    return merged_data

In [51]:
june_rentals = rentals_month(engine, 6)
customer_rentals_june = rental_count_month(june_rentals, 6)
customer_rentals_june

     customer_id  rentals_6_2005
0              1               7
1              2               1
2              3               4
3              4               6
4              5               5
..           ...             ...
585          595               2
586          596               2
587          597               3
588          598               1
589          599               4

[590 rows x 2 columns]

In [53]:
month_comparison = compare_rentals(customer_rentals_may, customer_rentals_june)
month_comparison

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1               2               7          -5
1              2               1               1           0
2              3               2               4          -2
3              5               3               5          -2
4              6               3               4          -1
..           ...             ...             ...         ...
507          594               4               6          -2
508          595               1               2          -1
509          596               6               2           4
510          597               2               3          -1
511          599               1               4          -3

[512 rows x 4 columns]